var relearn_searchindex = [
  {
    "breadcrumb": "Головна",
    "content": "This is a new chapter.",
    "description": "This is a new chapter.",
    "tags": [],
    "title": "Лекції",
    "uri": "/lectures/index.html"
  },
  {
    "breadcrumb": "",
    "content": "Вітаю 👋\rГоловна сторінка освітнього проєкту Code Osvita",
    "description": "Вітаю 👋\rГоловна сторінка освітнього проєкту Code Osvita",
    "tags": [],
    "title": "Головна",
    "uri": "/index.html"
  },
  {
    "breadcrumb": "Головна \u003e Лекції",
    "content": "Лекція 1\rОсновні відомості мови програмування Python\nПлан:\r1.1. Історична довідка\n1.2. Python в реальному світі\n1.2.1. Короткий опис\n1.2.2. Використання Python\n1.2.3. Версії Python\n2. Завантаження Python\n2.1. Середовище програмування для Python\n2.2 Текстові редактори та інтегровані середовища програмування для Python\n1.1. Історична довідка\rPython – динамічна інтерпретована об’єктно-орієнтована скриптова мова програмування із строгою динамічною типізацією. Розроблена в 1990 році голандським програмістом Гвідо ван Россумом .\nАвтор назвав мову на честь популярного британського комедійного серіалу 1970-х років «Літаючий цирк Монті Пайтона». Найчастіше вживане прочитання назви мови — «Па́йтон».\nОфіційний сайт мови програмування Python https://www.python.org/ .\n1.2. Python в реальному світі\r1.2.1. Короткий опис\rPython – багатоцільова мова програмування, яка дозволяє писати код, що добре читається. Відносний лаконізм мови Python дозволяє створити програму, яка буде набагато коротше свого аналога, написаного на іншій мові.\nPython - багатоплатформова мова програмування. Це означає, що програми на Python можна запускати в різних операційних системах без будь-яких змін.\nЩе однією перевагою Python є його стандартна бібліотека, яка встановлюється разом з Python і містить готові інструменти для роботи з операційною системою, веб-сторінками, базами даних, різними форматами даних, для побудови графічного інтерфейсу програм тощо.\nПрограми, написані на мові програмування Python, можуть бути як невеликими скриптами, так і складними системами.\nPython абсолютно безкоштовний.\nОдин з можливих недоліків Python - швидкість виконання коду. Python не є компільованою мовою. Код на Python спочатку компілюється у внутрішній байт-код, який потім виконується інтерпретатором Python. У більшості випадків при використанні Python виходять програми повільніші в порівнянні з такими мовами, як C.\nВтім, сучасні комп’ютери мають таку обчислювальну потужність, що для більшості застосунків швидкість розробки важливіша швидкості виконання, а програми на Python зазвичай пишуться набагато швидше.\nОкрім того, Python легко розширюється модулями, написаними на C або C++. Такі модулі можуть використовуватися для виконання частин програми, що створюють інтенсивне навантаження на процесор.\n./Л1_Вступ_до_Python.mp4\n1.2.2. Використання Python\rPython використовується для різних цілей: для створення ігор і веб-застосунків, розробки внутрішніх інструментів для різноманітніх проектів. Мова також широко застосовується в науковій області для досліджень і розв’язування прикладних завдань.\n1.2.3. Версії Python\rМови програмування з часом змінюються - розробники додають в них нові можливості, а також виправляють помилки. Так з’являються різні версії мови. Наприклад, код написаний на Python 2 у більшості випадків не буде працювати у версії Python 3 без внесення додаткових змін.\n2. Завантаження Python\rВерсії інтерпретатора Python для різних операційних систем доступні для безкоштовного завантаження за адресою https://www.python.org/downloads .\n2.1. Середовище програмування для Python\rДля написання програм використовують текстові редактори або інтегровані середовища розробки, які включають в себе різні інструменти для роботи з кодом: засіб для написання коду (текстовий редактор), інтерактивний інтерпретатор, відлагоджувач тощо.\n2.2 Текстові редактори та інтегровані середовища програмування для Python\rIDLE - стандартний редактор Python. Встановлюється разом з Python для користувачів Windows, окремим пакунком для користувачів Linux. Notepad++ - безкоштовний текстовий редактор початкового коду, який підтримує велику кількість мов, в тому числі і Python. Лише для користувачів Windows. Visual Studio Code - це легкий, але потужний редактор початкового коду, який розповсюджується безкоштовно і доступний у версіях для платформ Linux, Windows і macOS. PyScripter - інтегроване середовище розробки для мови програмування Python. Для користувачів Windows. Поширюється безкоштовно. Wing IDE 101 - вільне інтегроване середовище для Python, розроблене для навчання програмістів-початківців. Для користувачів Linux, Windows і macOS. Поширюється безкоштовно. Geany - вільний текстовий редактор з базовими елементами інтегрованого середовища розробки, доступний для операційних систем Linux, Windows і macOS. PyCharm - інтегроване середовище розробки для мови програмування Python. PyCharm є власницьким програмним забезпеченням. Наявна безкоштовна версія Community з усіченим набором можливостей. Для користувачів Linux, Windows і macOS. Thonny - IDE для вивчення програмування мовою Python. Для користувачів Linux, Windows і macOS. Mu - редактор коду Python для програмістів-початківців. Для користувачів Linux, Windows і macOS.",
    "description": "Лекція 1\rОсновні відомості мови програмування Python\nПлан:\r1.1. Історична довідка\n1.2. Python в реальному світі\n1.2.1. Короткий опис\n1.2.2. Використання Python\n1.2.3. Версії Python\n2. Завантаження Python\n2.1. Середовище програмування для Python\n2.2 Текстові редактори та інтегровані середовища програмування для Python",
    "tags": [],
    "title": "Лекція 1: Основні відомості мови програмування Python",
    "uri": "/lectures/lecture1/lecture1/index.html"
  },
  {
    "breadcrumb": "Головна",
    "content": "",
    "description": "",
    "tags": [],
    "title": "Categories",
    "uri": "/categories/index.html"
  },
  {
    "breadcrumb": "Головна",
    "content": "",
    "description": "",
    "tags": [],
    "title": "Tags",
    "uri": "/tags/index.html"
  },
  {
    "breadcrumb": "Головна",
    "content": "",
    "description": "",
    "tags": [],
    "title": "Лабораторні роботи",
    "uri": "/labs/index.html"
  },
  {
    "breadcrumb": "Головна",
    "content": "Інформація про розробника додатку\rКороткий опис сайту:\nОсвітні матеріали для вивчення програмування\nПосилання на навчальний заклад:\nhttps://sfknau.org.ua\nРозробники:\nКравцов Максим, Косар Олександр\nГрупа:\n2РПЗ22\nКурс:\n4 курс\nВикладач:\nСолдатова Вікторія Юріївна\nНавчальний заклад:\nНаціональний авіаційний університет (НАУ)",
    "description": "Інформація про розробника додатку\rКороткий опис сайту:\nОсвітні матеріали для вивчення програмування\nПосилання на навчальний заклад:\nhttps://sfknau.org.ua\nРозробники:\nКравцов Максим, Косар Олександр\nГрупа:\n2РПЗ22\nКурс:\n4 курс\nВикладач:\nСолдатова Вікторія Юріївна\nНавчальний заклад:\nНаціональний авіаційний університет (НАУ)",
    "tags": [],
    "title": "Про сайт",
    "uri": "/about/index.html"
  },
  {
    "breadcrumb": "Головна \u003e Тести",
    "content": "Завантаження…",
    "description": "Завантаження…",
    "tags": [],
    "title": "Тест до лабораторної №1",
    "uri": "/tests/lab1/test/index.html"
  },
  {
    "breadcrumb": "Головна \u003e Тести",
    "content": "Завантаження…",
    "description": "Завантаження…",
    "tags": [],
    "title": "Тест до лабораторної №2",
    "uri": "/tests/lab2/test/index.html"
  },
  {
    "breadcrumb": "Головна \u003e Тести",
    "content": "Завантаження…",
    "description": "Завантаження…",
    "tags": [],
    "title": "Тест до лабораторної №3",
    "uri": "/tests/lab3/test/index.html"
  },
  {
    "breadcrumb": "Головна \u003e Тести",
    "content": "Завантаження…",
    "description": "Завантаження…",
    "tags": [],
    "title": "Тест до лабораторної №4",
    "uri": "/tests/lab4/test/index.html"
  },
  {
    "breadcrumb": "Головна \u003e Тести",
    "content": "Завантаження…",
    "description": "Завантаження…",
    "tags": [],
    "title": "Тест до лабораторної №5",
    "uri": "/tests/lab5/test/index.html"
  },
  {
    "breadcrumb": "Головна \u003e Тести",
    "content": "Завантаження…",
    "description": "Завантаження…",
    "tags": [],
    "title": "Тест до лабораторної №6",
    "uri": "/tests/lab6/test/index.html"
  },
  {
    "breadcrumb": "Головна \u003e Тести",
    "content": "Завантаження…",
    "description": "Завантаження…",
    "tags": [],
    "title": "Тест до лабораторної №7",
    "uri": "/tests/lab7/test/index.html"
  },
  {
    "breadcrumb": "Головна",
    "content": "",
    "description": "",
    "tags": [],
    "title": "Тести",
    "uri": "/tests/index.html"
  }
]
